app/views/sidebar/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
<div class="sidebar_item sidebar_nav">
  <% Category.all.each do |category| %>

SELECT COUNT(*) FROM "posts" WHERE "posts"."category_name" = ?  [["category_name", "css"]]
---
      <div class="sidebar_nav_count">
        <%= Post.where(category_name: category.url_name).count %>