app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_ffa6706  ON posts_taggings_ffa6706.taggable_id = posts.id AND posts_taggings_ffa6706.taggable_type = 'Post' AND posts_taggings_ffa6706.tag_id = 4  ORDER BY created_at DESC
SELECT "categories".* FROM "categories"
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('one'))
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_name" = ?  [["category_name", "css"]]
---
  def index
    if params[:tag]
      @posts      = Post.tagged_with(params[:tag]).order('created_at DESC')
      @page_title = 'All posts tagges with ' + params[:tag]
    elsif params[:category]
      @posts      = Post.where(category_name: params[:category]).order('created_at DESC')
      @page_title = Category.where(url_name: params[:category])[0].title
    else
      @posts      = Post.all.order('created_at DESC')
      @page_title = 'Latest posts'
    end

    if @posts.length == 0

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "123"], ["body", "321"], ["created_at", "2015-08-27 14:49:49.295062"], ["updated_at", "2015-08-27 14:49:49.295062"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "<p>4df</p>\r\n"], ["updated_at", "2015-08-28 13:48:54.132138"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :thumbnail, :body, :description, :tag_list, :category_name))